SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG21/Include/efr32bg21_rac.h
/* Bit fields for RAC IEN */
#define _RAC_IEN_RESETVALUE                                           0x00000000UL                        /**< Default value for RAC_IEN                   */
#define _RAC_IEN_MASK                                                 0x00FF0007UL                        /**< Mask for RAC_IEN                            */
#define RAC_IEN_STATECHANGE                                           (0x1UL << 0)                        /**< Radio State Change Interrupt Enable         */
#define _RAC_IEN_STATECHANGE_SHIFT                                    0                                   /**< Shift value for RAC_STATECHANGE             */
#define _RAC_IEN_STATECHANGE_MASK                                     0x1UL                               /**< Bit mask for RAC_STATECHANGE                */
#define _RAC_IEN_STATECHANGE_DEFAULT                                  0x00000000UL                        /**< Mode DEFAULT for RAC_IEN                    */
#define RAC_IEN_STATECHANGE_DEFAULT                                   (_RAC_IEN_STATECHANGE_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_IEN            */
#define RAC_IEN_STIMCMPEV                                             (0x1UL << 1)                        /**< STIMER Compare Event Interrupt Enable       */
#define _RAC_IEN_STIMCMPEV_SHIFT                                      1                                   /**< Shift value for RAC_STIMCMPEV               */
#define _RAC_IEN_STIMCMPEV_MASK                                       0x2UL                               /**< Bit mask for RAC_STIMCMPEV                  */
#define _RAC_IEN_STIMCMPEV_DEFAULT                                    0x00000000UL                        /**< Mode DEFAULT for RAC_IEN                    */
#define RAC_IEN_STIMCMPEV_DEFAULT                                     (_RAC_IEN_STIMCMPEV_DEFAULT << 1)   /**< Shifted mode DEFAULT for RAC_IEN            */
#define RAC_IEN_BUSERROR                                              (0x1UL << 2)                        /**< Bus Error Interrupt Enable                  */
#define _RAC_IEN_BUSERROR_SHIFT                                       2                                   /**< Shift value for RAC_BUSERROR                */
#define _RAC_IEN_BUSERROR_MASK                                        0x4UL                               /**< Bit mask for RAC_BUSERROR                   */
#define _RAC_IEN_BUSERROR_DEFAULT                                     0x00000000UL                        /**< Mode DEFAULT for RAC_IEN                    */
#define RAC_IEN_BUSERROR_DEFAULT                                      (_RAC_IEN_BUSERROR_DEFAULT << 2)    /**< Shifted mode DEFAULT for RAC_IEN            */
#define _RAC_IEN_SEQ_SHIFT                                            16                                  /**< Shift value for RAC_SEQ                     */
#define _RAC_IEN_SEQ_MASK                                             0xFF0000UL                          /**< Bit mask for RAC_SEQ                        */
#define _RAC_IEN_SEQ_DEFAULT                                          0x00000000UL                        /**< Mode DEFAULT for RAC_IEN                    */
#define RAC_IEN_SEQ_DEFAULT                                           (_RAC_IEN_SEQ_DEFAULT << 16)        /**< Shifted mode DEFAULT for RAC_IEN            */

/* Bit fields for RAC TESTCTRL */
#define _RAC_TESTCTRL_RESETVALUE                                      0x00000000UL                                    /**< Default value for RAC_TESTCTRL              */
#define _RAC_TESTCTRL_MASK                                            0x0000001FUL                                    /**< Mask for RAC_TESTCTRL                       */
#define RAC_TESTCTRL_MODEN                                            (0x1UL << 0)                                    /**< Modulator enable                            */
#define _RAC_TESTCTRL_MODEN_SHIFT                                     0                                               /**< Shift value for RAC_MODEN                   */
#define _RAC_TESTCTRL_MODEN_MASK                                      0x1UL                                           /**< Bit mask for RAC_MODEN                      */
#define _RAC_TESTCTRL_MODEN_DEFAULT                                   0x00000000UL                                    /**< Mode DEFAULT for RAC_TESTCTRL               */
#define RAC_TESTCTRL_MODEN_DEFAULT                                    (_RAC_TESTCTRL_MODEN_DEFAULT << 0)              /**< Shifted mode DEFAULT for RAC_TESTCTRL       */
#define RAC_TESTCTRL_DEMODEN                                          (0x1UL << 1)                                    /**< Demodulator enable                          */
#define _RAC_TESTCTRL_DEMODEN_SHIFT                                   1                                               /**< Shift value for RAC_DEMODEN                 */
#define _RAC_TESTCTRL_DEMODEN_MASK                                    0x2UL                                           /**< Bit mask for RAC_DEMODEN                    */
#define _RAC_TESTCTRL_DEMODEN_DEFAULT                                 0x00000000UL                                    /**< Mode DEFAULT for RAC_TESTCTRL               */
#define RAC_TESTCTRL_DEMODEN_DEFAULT                                  (_RAC_TESTCTRL_DEMODEN_DEFAULT << 1)            /**< Shifted mode DEFAULT for RAC_TESTCTRL       */
#define RAC_TESTCTRL_AUX2RFSENSE                                      (0x1UL << 2)                                    /**< Enable auxiliary synthesizer output         */
#define _RAC_TESTCTRL_AUX2RFSENSE_SHIFT                               2                                               /**< Shift value for RAC_AUX2RFSENSE             */
#define _RAC_TESTCTRL_AUX2RFSENSE_MASK                                0x4UL                                           /**< Bit mask for RAC_AUX2RFSENSE                */
#define _RAC_TESTCTRL_AUX2RFSENSE_DEFAULT                             0x00000000UL                                    /**< Mode DEFAULT for RAC_TESTCTRL               */
#define _RAC_TESTCTRL_AUX2RFSENSE_X0                                  0x00000000UL                                    /**< Mode X0 for RAC_TESTCTRL                    */
#define _RAC_TESTCTRL_AUX2RFSENSE_X1                                  0x00000001UL                                    /**< Mode X1 for RAC_TESTCTRL                    */
#define RAC_TESTCTRL_AUX2RFSENSE_DEFAULT                              (_RAC_TESTCTRL_AUX2RFSENSE_DEFAULT << 2)        /**< Shifted mode DEFAULT for RAC_TESTCTRL       */
#define RAC_TESTCTRL_AUX2RFSENSE_X0                                   (_RAC_TESTCTRL_AUX2RFSENSE_X0 << 2)             /**< Shifted mode X0 for RAC_TESTCTRL            */
#define RAC_TESTCTRL_AUX2RFSENSE_X1                                   (_RAC_TESTCTRL_AUX2RFSENSE_X1 << 2)             /**< Shifted mode X1 for RAC_TESTCTRL            */
#define RAC_TESTCTRL_LOOPBACK2LNAINPUT                                (0x1UL << 3)                                    /**< Enable RF loopback                          */
#define _RAC_TESTCTRL_LOOPBACK2LNAINPUT_SHIFT                         3                                               /**< Shift value for RAC_LOOPBACK2LNAINPUT       */
#define _RAC_TESTCTRL_LOOPBACK2LNAINPUT_MASK                          0x8UL                                           /**< Bit mask for RAC_LOOPBACK2LNAINPUT          */
#define _RAC_TESTCTRL_LOOPBACK2LNAINPUT_DEFAULT                       0x00000000UL                                    /**< Mode DEFAULT for RAC_TESTCTRL               */
#define RAC_TESTCTRL_LOOPBACK2LNAINPUT_DEFAULT                        (_RAC_TESTCTRL_LOOPBACK2LNAINPUT_DEFAULT << 3)  /**< Shifted mode DEFAULT for RAC_TESTCTRL       */
#define RAC_TESTCTRL_LOOPBACK2LNAOUTPUT                               (0x1UL << 4)                                    /**< Enable RF loopback                          */
#define _RAC_TESTCTRL_LOOPBACK2LNAOUTPUT_SHIFT                        4                                               /**< Shift value for RAC_LOOPBACK2LNAOUTPUT      */
#define _RAC_TESTCTRL_LOOPBACK2LNAOUTPUT_MASK                         0x10UL                                          /**< Bit mask for RAC_LOOPBACK2LNAOUTPUT         */
#define _RAC_TESTCTRL_LOOPBACK2LNAOUTPUT_DEFAULT                      0x00000000UL                                    /**< Mode DEFAULT for RAC_TESTCTRL               */
#define RAC_TESTCTRL_LOOPBACK2LNAOUTPUT_DEFAULT                       (_RAC_TESTCTRL_LOOPBACK2LNAOUTPUT_DEFAULT << 4) /**< Shifted mode DEFAULT for RAC_TESTCTRL       */

/* Bit fields for RAC SEQSTATUS */
#define _RAC_SEQSTATUS_RESETVALUE                                     0x00000010UL                           /**< Default value for RAC_SEQSTATUS             */
#define _RAC_SEQSTATUS_MASK                                           0x000005FFUL                           /**< Mask for RAC_SEQSTATUS                      */
#define RAC_SEQSTATUS_STOPPED                                         (0x1UL << 0)                           /**< Sequencer Stopped                           */
#define _RAC_SEQSTATUS_STOPPED_SHIFT                                  0                                      /**< Shift value for RAC_STOPPED                 */
#define _RAC_SEQSTATUS_STOPPED_MASK                                   0x1UL                                  /**< Bit mask for RAC_STOPPED                    */
#define _RAC_SEQSTATUS_STOPPED_DEFAULT                                0x00000000UL                           /**< Mode DEFAULT for RAC_SEQSTATUS              */
#define RAC_SEQSTATUS_STOPPED_DEFAULT                                 (_RAC_SEQSTATUS_STOPPED_DEFAULT << 0)  /**< Shifted mode DEFAULT for RAC_SEQSTATUS      */
#define RAC_SEQSTATUS_BKPT                                            (0x1UL << 1)                           /**< Breakpoint Enabled                          */
#define _RAC_SEQSTATUS_BKPT_SHIFT                                     1                                      /**< Shift value for RAC_BKPT                    */
#define _RAC_SEQSTATUS_BKPT_MASK                                      0x2UL                                  /**< Bit mask for RAC_BKPT                       */
#define _RAC_SEQSTATUS_BKPT_DEFAULT                                   0x00000000UL                           /**< Mode DEFAULT for RAC_SEQSTATUS              */
#define RAC_SEQSTATUS_BKPT_DEFAULT                                    (_RAC_SEQSTATUS_BKPT_DEFAULT << 1)     /**< Shifted mode DEFAULT for RAC_SEQSTATUS      */
#define RAC_SEQSTATUS_WAITING                                         (0x1UL << 2)                           /**< Sequencer Waiting                           */
#define _RAC_SEQSTATUS_WAITING_SHIFT                                  2                                      /**< Shift value for RAC_WAITING                 */
#define _RAC_SEQSTATUS_WAITING_MASK                                   0x4UL                                  /**< Bit mask for RAC_WAITING                    */
#define _RAC_SEQSTATUS_WAITING_DEFAULT                                0x00000000UL                           /**< Mode DEFAULT for RAC_SEQSTATUS              */
#define RAC_SEQSTATUS_WAITING_DEFAULT                                 (_RAC_SEQSTATUS_WAITING_DEFAULT << 2)  /**< Shifted mode DEFAULT for RAC_SEQSTATUS      */
#define RAC_SEQSTATUS_WAITMODE                                        (0x1UL << 3)                           /**< Sequencer Waiting Mode                      */
#define _RAC_SEQSTATUS_WAITMODE_SHIFT                                 3                                      /**< Shift value for RAC_WAITMODE                */
#define _RAC_SEQSTATUS_WAITMODE_MASK                                  0x8UL                                  /**< Bit mask for RAC_WAITMODE                   */
#define _RAC_SEQSTATUS_WAITMODE_DEFAULT                               0x00000000UL                           /**< Mode DEFAULT for RAC_SEQSTATUS              */
#define _RAC_SEQSTATUS_WAITMODE_ANY                                   0x00000000UL                           /**< Mode ANY for RAC_SEQSTATUS                  */
#define _RAC_SEQSTATUS_WAITMODE_ALL                                   0x00000001UL                           /**< Mode ALL for RAC_SEQSTATUS                  */
#define RAC_SEQSTATUS_WAITMODE_DEFAULT                                (_RAC_SEQSTATUS_WAITMODE_DEFAULT << 3) /**< Shifted mode DEFAULT for RAC_SEQSTATUS      */
#define RAC_SEQSTATUS_WAITMODE_ANY                                    (_RAC_SEQSTATUS_WAITMODE_ANY << 3)     /**< Shifted mode ANY for RAC_SEQSTATUS          */
#define RAC_SEQSTATUS_WAITMODE_ALL                                    (_RAC_SEQSTATUS_WAITMODE_ALL << 3)     /**< Shifted mode ALL for RAC_SEQSTATUS          */
#define RAC_SEQSTATUS_DONE                                            (0x1UL << 4)                           /**< Sequencer Done Signal                       */
#define _RAC_SEQSTATUS_DONE_SHIFT                                     4                                      /**< Shift value for RAC_DONE                    */
#define _RAC_SEQSTATUS_DONE_MASK                                      0x10UL                                 /**< Bit mask for RAC_DONE                       */
#define _RAC_SEQSTATUS_DONE_DEFAULT                                   0x00000001UL                           /**< Mode DEFAULT for RAC_SEQSTATUS              */
#define RAC_SEQSTATUS_DONE_DEFAULT                                    (_RAC_SEQSTATUS_DONE_DEFAULT << 4)     /**< Shifted mode DEFAULT for RAC_SEQSTATUS      */
#define RAC_SEQSTATUS_NEG                                             (0x1UL << 5)                           /**< Negative Flag                               */
#define _RAC_SEQSTATUS_NEG_SHIFT                                      5                                      /**< Shift value for RAC_NEG                     */
#define _RAC_SEQSTATUS_NEG_MASK                                       0x20UL                                 /**< Bit mask for RAC_NEG                        */
#define _RAC_SEQSTATUS_NEG_DEFAULT                                    0x00000000UL                           /**< Mode DEFAULT for RAC_SEQSTATUS              */
#define RAC_SEQSTATUS_NEG_DEFAULT                                     (_RAC_SEQSTATUS_NEG_DEFAULT << 5)      /**< Shifted mode DEFAULT for RAC_SEQSTATUS      */
#define RAC_SEQSTATUS_POS                                             (0x1UL << 6)                           /**< Positive Flag                               */
#define _RAC_SEQSTATUS_POS_SHIFT                                      6                                      /**< Shift value for RAC_POS                     */
#define _RAC_SEQSTATUS_POS_MASK                                       0x40UL                                 /**< Bit mask for RAC_POS                        */
#define _RAC_SEQSTATUS_POS_DEFAULT                                    0x00000000UL                           /**< Mode DEFAULT for RAC_SEQSTATUS              */
#define RAC_SEQSTATUS_POS_DEFAULT                                     (_RAC_SEQSTATUS_POS_DEFAULT << 6)      /**< Shifted mode DEFAULT for RAC_SEQSTATUS      */
#define RAC_SEQSTATUS_ZERO                                            (0x1UL << 7)                           /**< Zero Flag                                   */
#define _RAC_SEQSTATUS_ZERO_SHIFT                                     7                                      /**< Shift value for RAC_ZERO                    */
#define _RAC_SEQSTATUS_ZERO_MASK                                      0x80UL                                 /**< Bit mask for RAC_ZERO                       */
#define _RAC_SEQSTATUS_ZERO_DEFAULT                                   0x00000000UL                           /**< Mode DEFAULT for RAC_SEQSTATUS              */
#define RAC_SEQSTATUS_ZERO_DEFAULT                                    (_RAC_SEQSTATUS_ZERO_DEFAULT << 7)     /**< Shifted mode DEFAULT for RAC_SEQSTATUS      */
#define RAC_SEQSTATUS_CARRY                                           (0x1UL << 8)                           /**< Carry Flag                                  */
#define _RAC_SEQSTATUS_CARRY_SHIFT                                    8                                      /**< Shift value for RAC_CARRY                   */
#define _RAC_SEQSTATUS_CARRY_MASK                                     0x100UL                                /**< Bit mask for RAC_CARRY                      */
#define _RAC_SEQSTATUS_CARRY_DEFAULT                                  0x00000000UL                           /**< Mode DEFAULT for RAC_SEQSTATUS              */
#define RAC_SEQSTATUS_CARRY_DEFAULT                                   (_RAC_SEQSTATUS_CARRY_DEFAULT << 8)    /**< Shifted mode DEFAULT for RAC_SEQSTATUS      */
#define RAC_SEQSTATUS_ABORTEN                                         (0x1UL << 10)                          /**< Sequencer Program Execution Abort Enable    */
#define _RAC_SEQSTATUS_ABORTEN_SHIFT                                  10                                     /**< Shift value for RAC_ABORTEN                 */
#define _RAC_SEQSTATUS_ABORTEN_MASK                                   0x400UL                                /**< Bit mask for RAC_ABORTEN                    */
#define _RAC_SEQSTATUS_ABORTEN_DEFAULT                                0x00000000UL                           /**< Mode DEFAULT for RAC_SEQSTATUS              */
#define _RAC_SEQSTATUS_ABORTEN_X0                                     0x00000000UL                           /**< Mode X0 for RAC_SEQSTATUS                   */
#define _RAC_SEQSTATUS_ABORTEN_X1                                     0x00000001UL                           /**< Mode X1 for RAC_SEQSTATUS                   */
#define RAC_SEQSTATUS_ABORTEN_DEFAULT                                 (_RAC_SEQSTATUS_ABORTEN_DEFAULT << 10) /**< Shifted mode DEFAULT for RAC_SEQSTATUS      */
#define RAC_SEQSTATUS_ABORTEN_X0                                      (_RAC_SEQSTATUS_ABORTEN_X0 << 10)      /**< Shifted mode X0 for RAC_SEQSTATUS           */
#define RAC_SEQSTATUS_ABORTEN_X1                                      (_RAC_SEQSTATUS_ABORTEN_X1 << 10)      /**< Shifted mode X1 for RAC_SEQSTATUS           */

