SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG21/Include/efr32bg21_rac.h
/* Bit fields for RAC SEQCMD */
#define _RAC_SEQCMD_RESETVALUE                                        0x00000000UL                            /**< Default value for RAC_SEQCMD                */
#define _RAC_SEQCMD_MASK                                              0x000000FFUL                            /**< Mask for RAC_SEQCMD                         */
#define RAC_SEQCMD_HALT                                               (0x1UL << 0)                            /**< Sequencer Halt                              */
#define _RAC_SEQCMD_HALT_SHIFT                                        0                                       /**< Shift value for RAC_HALT                    */
#define _RAC_SEQCMD_HALT_MASK                                         0x1UL                                   /**< Bit mask for RAC_HALT                       */
#define _RAC_SEQCMD_HALT_DEFAULT                                      0x00000000UL                            /**< Mode DEFAULT for RAC_SEQCMD                 */
#define RAC_SEQCMD_HALT_DEFAULT                                       (_RAC_SEQCMD_HALT_DEFAULT << 0)         /**< Shifted mode DEFAULT for RAC_SEQCMD         */
#define RAC_SEQCMD_STEP                                               (0x1UL << 1)                            /**< Sequencer Step                              */
#define _RAC_SEQCMD_STEP_SHIFT                                        1                                       /**< Shift value for RAC_STEP                    */
#define _RAC_SEQCMD_STEP_MASK                                         0x2UL                                   /**< Bit mask for RAC_STEP                       */
#define _RAC_SEQCMD_STEP_DEFAULT                                      0x00000000UL                            /**< Mode DEFAULT for RAC_SEQCMD                 */
#define RAC_SEQCMD_STEP_DEFAULT                                       (_RAC_SEQCMD_STEP_DEFAULT << 1)         /**< Shifted mode DEFAULT for RAC_SEQCMD         */
#define RAC_SEQCMD_RESUME                                             (0x1UL << 2)                            /**< Sequencer Resume                            */
#define _RAC_SEQCMD_RESUME_SHIFT                                      2                                       /**< Shift value for RAC_RESUME                  */
#define _RAC_SEQCMD_RESUME_MASK                                       0x4UL                                   /**< Bit mask for RAC_RESUME                     */
#define _RAC_SEQCMD_RESUME_DEFAULT                                    0x00000000UL                            /**< Mode DEFAULT for RAC_SEQCMD                 */
#define RAC_SEQCMD_RESUME_DEFAULT                                     (_RAC_SEQCMD_RESUME_DEFAULT << 2)       /**< Shifted mode DEFAULT for RAC_SEQCMD         */
#define RAC_SEQCMD_BKPTEN                                             (0x1UL << 3)                            /**< Breakpoint Enable                           */
#define _RAC_SEQCMD_BKPTEN_SHIFT                                      3                                       /**< Shift value for RAC_BKPTEN                  */
#define _RAC_SEQCMD_BKPTEN_MASK                                       0x8UL                                   /**< Bit mask for RAC_BKPTEN                     */
#define _RAC_SEQCMD_BKPTEN_DEFAULT                                    0x00000000UL                            /**< Mode DEFAULT for RAC_SEQCMD                 */
#define RAC_SEQCMD_BKPTEN_DEFAULT                                     (_RAC_SEQCMD_BKPTEN_DEFAULT << 3)       /**< Shifted mode DEFAULT for RAC_SEQCMD         */
#define RAC_SEQCMD_BKPTDIS                                            (0x1UL << 4)                            /**< Breakpoint Disable                          */
#define _RAC_SEQCMD_BKPTDIS_SHIFT                                     4                                       /**< Shift value for RAC_BKPTDIS                 */
#define _RAC_SEQCMD_BKPTDIS_MASK                                      0x10UL                                  /**< Bit mask for RAC_BKPTDIS                    */
#define _RAC_SEQCMD_BKPTDIS_DEFAULT                                   0x00000000UL                            /**< Mode DEFAULT for RAC_SEQCMD                 */
#define RAC_SEQCMD_BKPTDIS_DEFAULT                                    (_RAC_SEQCMD_BKPTDIS_DEFAULT << 4)      /**< Shifted mode DEFAULT for RAC_SEQCMD         */
#define RAC_SEQCMD_ABORT                                              (0x1UL << 5)                            /**< Sequencer Execution Abort                   */
#define _RAC_SEQCMD_ABORT_SHIFT                                       5                                       /**< Shift value for RAC_ABORT                   */
#define _RAC_SEQCMD_ABORT_MASK                                        0x20UL                                  /**< Bit mask for RAC_ABORT                      */
#define _RAC_SEQCMD_ABORT_DEFAULT                                     0x00000000UL                            /**< Mode DEFAULT for RAC_SEQCMD                 */
#define RAC_SEQCMD_ABORT_DEFAULT                                      (_RAC_SEQCMD_ABORT_DEFAULT << 5)        /**< Shifted mode DEFAULT for RAC_SEQCMD         */
#define RAC_SEQCMD_ABORTENSET                                         (0x1UL << 6)                            /**< Set Sequencer Abort Enable                  */
#define _RAC_SEQCMD_ABORTENSET_SHIFT                                  6                                       /**< Shift value for RAC_ABORTENSET              */
#define _RAC_SEQCMD_ABORTENSET_MASK                                   0x40UL                                  /**< Bit mask for RAC_ABORTENSET                 */
#define _RAC_SEQCMD_ABORTENSET_DEFAULT                                0x00000000UL                            /**< Mode DEFAULT for RAC_SEQCMD                 */
#define RAC_SEQCMD_ABORTENSET_DEFAULT                                 (_RAC_SEQCMD_ABORTENSET_DEFAULT << 6)   /**< Shifted mode DEFAULT for RAC_SEQCMD         */
#define RAC_SEQCMD_ABORTENCLEAR                                       (0x1UL << 7)                            /**< Clear Sequencer Abort Enable                */
#define _RAC_SEQCMD_ABORTENCLEAR_SHIFT                                7                                       /**< Shift value for RAC_ABORTENCLEAR            */
#define _RAC_SEQCMD_ABORTENCLEAR_MASK                                 0x80UL                                  /**< Bit mask for RAC_ABORTENCLEAR               */
#define _RAC_SEQCMD_ABORTENCLEAR_DEFAULT                              0x00000000UL                            /**< Mode DEFAULT for RAC_SEQCMD                 */
#define RAC_SEQCMD_ABORTENCLEAR_DEFAULT                               (_RAC_SEQCMD_ABORTENCLEAR_DEFAULT << 7) /**< Shifted mode DEFAULT for RAC_SEQCMD         */

/* Bit fields for RAC BREAKPOINT */
#define _RAC_BREAKPOINT_RESETVALUE                                    0x00000000UL                           /**< Default value for RAC_BREAKPOINT            */
#define _RAC_BREAKPOINT_MASK                                          0xFFFFFFFFUL                           /**< Mask for RAC_BREAKPOINT                     */
#define _RAC_BREAKPOINT_BKPADDR_SHIFT                                 0                                      /**< Shift value for RAC_BKPADDR                 */
#define _RAC_BREAKPOINT_BKPADDR_MASK                                  0xFFFFFFFFUL                           /**< Bit mask for RAC_BKPADDR                    */
#define _RAC_BREAKPOINT_BKPADDR_DEFAULT                               0x00000000UL                           /**< Mode DEFAULT for RAC_BREAKPOINT             */
#define RAC_BREAKPOINT_BKPADDR_DEFAULT                                (_RAC_BREAKPOINT_BKPADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_BREAKPOINT     */

