SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG21/Include/efr32bg21_rac.h
#define _RAC_PATRIM2_PATRIMLDOSLICESPDRVLDO_DEFAULT                   0x00000003UL                                             /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_PATRIMLDOSLICESPDRVLDO_iload_7p5mA               0x00000000UL                                             /**< Mode iload_7p5mA for RAC_PATRIM2            */
#define _RAC_PATRIM2_PATRIMLDOSLICESPDRVLDO_iload_15mA                0x00000001UL                                             /**< Mode iload_15mA for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOSLICESPDRVLDO_iload_22p5mA              0x00000002UL                                             /**< Mode iload_22p5mA for RAC_PATRIM2           */
#define _RAC_PATRIM2_PATRIMLDOSLICESPDRVLDO_iload_30mA                0x00000003UL                                             /**< Mode iload_30mA for RAC_PATRIM2             */
#define RAC_PATRIM2_PATRIMLDOSLICESPDRVLDO_DEFAULT                    (_RAC_PATRIM2_PATRIMLDOSLICESPDRVLDO_DEFAULT << 14)      /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_PATRIMLDOSLICESPDRVLDO_iload_7p5mA                (_RAC_PATRIM2_PATRIMLDOSLICESPDRVLDO_iload_7p5mA << 14)  /**< Shifted mode iload_7p5mA for RAC_PATRIM2    */
#define RAC_PATRIM2_PATRIMLDOSLICESPDRVLDO_iload_15mA                 (_RAC_PATRIM2_PATRIMLDOSLICESPDRVLDO_iload_15mA << 14)   /**< Shifted mode iload_15mA for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOSLICESPDRVLDO_iload_22p5mA               (_RAC_PATRIM2_PATRIMLDOSLICESPDRVLDO_iload_22p5mA << 14) /**< Shifted mode iload_22p5mA for RAC_PATRIM2   */
#define RAC_PATRIM2_PATRIMLDOSLICESPDRVLDO_iload_30mA                 (_RAC_PATRIM2_PATRIMLDOSLICESPDRVLDO_iload_30mA << 14)   /**< Shifted mode iload_30mA for RAC_PATRIM2     */
#define _RAC_PATRIM2_PATRIMLDOSLICESPREREG_SHIFT                      16                                                       /**< Shift value for RAC_PATRIMLDOSLICESPREREG   */
#define _RAC_PATRIM2_PATRIMLDOSLICESPREREG_MASK                       0x30000UL                                                /**< Bit mask for RAC_PATRIMLDOSLICESPREREG      */
#define _RAC_PATRIM2_PATRIMLDOSLICESPREREG_DEFAULT                    0x00000000UL                                             /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_PATRIMLDOSLICESPREREG_spare1                     0x00000000UL                                             /**< Mode spare1 for RAC_PATRIM2                 */
#define _RAC_PATRIM2_PATRIMLDOSLICESPREREG_spare2                     0x00000001UL                                             /**< Mode spare2 for RAC_PATRIM2                 */
#define _RAC_PATRIM2_PATRIMLDOSLICESPREREG_spare3                     0x00000002UL                                             /**< Mode spare3 for RAC_PATRIM2                 */
#define _RAC_PATRIM2_PATRIMLDOSLICESPREREG_spare4                     0x00000003UL                                             /**< Mode spare4 for RAC_PATRIM2                 */
#define RAC_PATRIM2_PATRIMLDOSLICESPREREG_DEFAULT                     (_RAC_PATRIM2_PATRIMLDOSLICESPREREG_DEFAULT << 16)       /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_PATRIMLDOSLICESPREREG_spare1                      (_RAC_PATRIM2_PATRIMLDOSLICESPREREG_spare1 << 16)        /**< Shifted mode spare1 for RAC_PATRIM2         */
#define RAC_PATRIM2_PATRIMLDOSLICESPREREG_spare2                      (_RAC_PATRIM2_PATRIMLDOSLICESPREREG_spare2 << 16)        /**< Shifted mode spare2 for RAC_PATRIM2         */
#define RAC_PATRIM2_PATRIMLDOSLICESPREREG_spare3                      (_RAC_PATRIM2_PATRIMLDOSLICESPREREG_spare3 << 16)        /**< Shifted mode spare3 for RAC_PATRIM2         */
#define RAC_PATRIM2_PATRIMLDOSLICESPREREG_spare4                      (_RAC_PATRIM2_PATRIMLDOSLICESPREREG_spare4 << 16)        /**< Shifted mode spare4 for RAC_PATRIM2         */
#define RAC_PATRIM2_PATRIMPADACGLITCH                                 (0x1UL << 18)                                            /**< PATRIMPADACGLITCH                           */
#define _RAC_PATRIM2_PATRIMPADACGLITCH_SHIFT                          18                                                       /**< Shift value for RAC_PATRIMPADACGLITCH       */
#define _RAC_PATRIM2_PATRIMPADACGLITCH_MASK                           0x40000UL                                                /**< Bit mask for RAC_PATRIMPADACGLITCH          */
#define _RAC_PATRIM2_PATRIMPADACGLITCH_DEFAULT                        0x00000000UL                                             /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_PATRIMPADACGLITCH_larger_glitch                  0x00000000UL                                             /**< Mode larger_glitch for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMPADACGLITCH_smaller_glitch                 0x00000001UL                                             /**< Mode smaller_glitch for RAC_PATRIM2         */
#define RAC_PATRIM2_PATRIMPADACGLITCH_DEFAULT                         (_RAC_PATRIM2_PATRIMPADACGLITCH_DEFAULT << 18)           /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_PATRIMPADACGLITCH_larger_glitch                   (_RAC_PATRIM2_PATRIMPADACGLITCH_larger_glitch << 18)     /**< Shifted mode larger_glitch for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMPADACGLITCH_smaller_glitch                  (_RAC_PATRIM2_PATRIMPADACGLITCH_smaller_glitch << 18)    /**< Shifted mode smaller_glitch for RAC_PATRIM2 */
#define _RAC_PATRIM2_PATRIMNBIAS_SHIFT                                19                                                       /**< Shift value for RAC_PATRIMNBIAS             */
#define _RAC_PATRIM2_PATRIMNBIAS_MASK                                 0x780000UL                                               /**< Bit mask for RAC_PATRIMNBIAS                */
#define _RAC_PATRIM2_PATRIMNBIAS_DEFAULT                              0x00000008UL                                             /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_PATRIMNBIAS_vnbias_dn104mv                       0x00000000UL                                             /**< Mode vnbias_dn104mv for RAC_PATRIM2         */
#define _RAC_PATRIM2_PATRIMNBIAS_vnbias_dn91mv                        0x00000001UL                                             /**< Mode vnbias_dn91mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMNBIAS_vnbias_dn78mv                        0x00000002UL                                             /**< Mode vnbias_dn78mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMNBIAS_vnbias_dn65mv                        0x00000003UL                                             /**< Mode vnbias_dn65mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMNBIAS_vnbias_dn52mv                        0x00000004UL                                             /**< Mode vnbias_dn52mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMNBIAS_vnbias_dn39mv                        0x00000005UL                                             /**< Mode vnbias_dn39mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMNBIAS_vnbias_dn26mv                        0x00000006UL                                             /**< Mode vnbias_dn26mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMNBIAS_vnbias_dn13mv                        0x00000007UL                                             /**< Mode vnbias_dn13mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMNBIAS_vnbias_default                       0x00000008UL                                             /**< Mode vnbias_default for RAC_PATRIM2         */
#define _RAC_PATRIM2_PATRIMNBIAS_vnbias_up13mv                        0x00000009UL                                             /**< Mode vnbias_up13mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMNBIAS_vnbias_up26mv                        0x0000000AUL                                             /**< Mode vnbias_up26mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMNBIAS_vnbias_up39mv                        0x0000000BUL                                             /**< Mode vnbias_up39mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMNBIAS_vnbias_up52mv                        0x0000000CUL                                             /**< Mode vnbias_up52mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMNBIAS_vnbias_up65mv                        0x0000000DUL                                             /**< Mode vnbias_up65mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMNBIAS_vnbias_up78mv                        0x0000000EUL                                             /**< Mode vnbias_up78mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMNBIAS_vnbias_up91mv                        0x0000000FUL                                             /**< Mode vnbias_up91mv for RAC_PATRIM2          */
#define RAC_PATRIM2_PATRIMNBIAS_DEFAULT                               (_RAC_PATRIM2_PATRIMNBIAS_DEFAULT << 19)                 /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_PATRIMNBIAS_vnbias_dn104mv                        (_RAC_PATRIM2_PATRIMNBIAS_vnbias_dn104mv << 19)          /**< Shifted mode vnbias_dn104mv for RAC_PATRIM2 */
#define RAC_PATRIM2_PATRIMNBIAS_vnbias_dn91mv                         (_RAC_PATRIM2_PATRIMNBIAS_vnbias_dn91mv << 19)           /**< Shifted mode vnbias_dn91mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMNBIAS_vnbias_dn78mv                         (_RAC_PATRIM2_PATRIMNBIAS_vnbias_dn78mv << 19)           /**< Shifted mode vnbias_dn78mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMNBIAS_vnbias_dn65mv                         (_RAC_PATRIM2_PATRIMNBIAS_vnbias_dn65mv << 19)           /**< Shifted mode vnbias_dn65mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMNBIAS_vnbias_dn52mv                         (_RAC_PATRIM2_PATRIMNBIAS_vnbias_dn52mv << 19)           /**< Shifted mode vnbias_dn52mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMNBIAS_vnbias_dn39mv                         (_RAC_PATRIM2_PATRIMNBIAS_vnbias_dn39mv << 19)           /**< Shifted mode vnbias_dn39mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMNBIAS_vnbias_dn26mv                         (_RAC_PATRIM2_PATRIMNBIAS_vnbias_dn26mv << 19)           /**< Shifted mode vnbias_dn26mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMNBIAS_vnbias_dn13mv                         (_RAC_PATRIM2_PATRIMNBIAS_vnbias_dn13mv << 19)           /**< Shifted mode vnbias_dn13mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMNBIAS_vnbias_default                        (_RAC_PATRIM2_PATRIMNBIAS_vnbias_default << 19)          /**< Shifted mode vnbias_default for RAC_PATRIM2 */
#define RAC_PATRIM2_PATRIMNBIAS_vnbias_up13mv                         (_RAC_PATRIM2_PATRIMNBIAS_vnbias_up13mv << 19)           /**< Shifted mode vnbias_up13mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMNBIAS_vnbias_up26mv                         (_RAC_PATRIM2_PATRIMNBIAS_vnbias_up26mv << 19)           /**< Shifted mode vnbias_up26mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMNBIAS_vnbias_up39mv                         (_RAC_PATRIM2_PATRIMNBIAS_vnbias_up39mv << 19)           /**< Shifted mode vnbias_up39mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMNBIAS_vnbias_up52mv                         (_RAC_PATRIM2_PATRIMNBIAS_vnbias_up52mv << 19)           /**< Shifted mode vnbias_up52mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMNBIAS_vnbias_up65mv                         (_RAC_PATRIM2_PATRIMNBIAS_vnbias_up65mv << 19)           /**< Shifted mode vnbias_up65mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMNBIAS_vnbias_up78mv                         (_RAC_PATRIM2_PATRIMNBIAS_vnbias_up78mv << 19)           /**< Shifted mode vnbias_up78mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMNBIAS_vnbias_up91mv                         (_RAC_PATRIM2_PATRIMNBIAS_vnbias_up91mv << 19)           /**< Shifted mode vnbias_up91mv for RAC_PATRIM2  */
#define _RAC_PATRIM2_PATRIMNCASC_SHIFT                                23                                                       /**< Shift value for RAC_PATRIMNCASC             */
#define _RAC_PATRIM2_PATRIMNCASC_MASK                                 0x1800000UL                                              /**< Bit mask for RAC_PATRIMNCASC                */
#define _RAC_PATRIM2_PATRIMNCASC_DEFAULT                              0x00000001UL                                             /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_PATRIMNCASC_ncbias_m50mv                         0x00000000UL                                             /**< Mode ncbias_m50mv for RAC_PATRIM2           */
#define _RAC_PATRIM2_PATRIMNCASC_ncbias_default                       0x00000001UL                                             /**< Mode ncbias_default for RAC_PATRIM2         */
#define _RAC_PATRIM2_PATRIMNCASC_ncbias_p50mv                         0x00000002UL                                             /**< Mode ncbias_p50mv for RAC_PATRIM2           */
#define _RAC_PATRIM2_PATRIMNCASC_ncbias_p100mv                        0x00000003UL                                             /**< Mode ncbias_p100mv for RAC_PATRIM2          */
#define RAC_PATRIM2_PATRIMNCASC_DEFAULT                               (_RAC_PATRIM2_PATRIMNCASC_DEFAULT << 23)                 /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_PATRIMNCASC_ncbias_m50mv                          (_RAC_PATRIM2_PATRIMNCASC_ncbias_m50mv << 23)            /**< Shifted mode ncbias_m50mv for RAC_PATRIM2   */
#define RAC_PATRIM2_PATRIMNCASC_ncbias_default                        (_RAC_PATRIM2_PATRIMNCASC_ncbias_default << 23)          /**< Shifted mode ncbias_default for RAC_PATRIM2 */
#define RAC_PATRIM2_PATRIMNCASC_ncbias_p50mv                          (_RAC_PATRIM2_PATRIMNCASC_ncbias_p50mv << 23)            /**< Shifted mode ncbias_p50mv for RAC_PATRIM2   */
#define RAC_PATRIM2_PATRIMNCASC_ncbias_p100mv                         (_RAC_PATRIM2_PATRIMNCASC_ncbias_p100mv << 23)           /**< Shifted mode ncbias_p100mv for RAC_PATRIM2  */
#define _RAC_PATRIM2_PATRIMPBIAS_SHIFT                                25                                                       /**< Shift value for RAC_PATRIMPBIAS             */
#define _RAC_PATRIM2_PATRIMPBIAS_MASK                                 0x1E000000UL                                             /**< Bit mask for RAC_PATRIMPBIAS                */
#define _RAC_PATRIM2_PATRIMPBIAS_DEFAULT                              0x00000008UL                                             /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_PATRIMPBIAS_vpbias_up104mv                       0x00000000UL                                             /**< Mode vpbias_up104mv for RAC_PATRIM2         */
#define _RAC_PATRIM2_PATRIMPBIAS_vpbias_up91mv                        0x00000001UL                                             /**< Mode vpbias_up91mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMPBIAS_vpbias_up78mv                        0x00000002UL                                             /**< Mode vpbias_up78mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMPBIAS_vpbias_up65mv                        0x00000003UL                                             /**< Mode vpbias_up65mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMPBIAS_vpbias_up52mv                        0x00000004UL                                             /**< Mode vpbias_up52mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMPBIAS_vpbias_up39mv                        0x00000005UL                                             /**< Mode vpbias_up39mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMPBIAS_vpbias_up26mv                        0x00000006UL                                             /**< Mode vpbias_up26mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMPBIAS_vpbias_up13mv                        0x00000007UL                                             /**< Mode vpbias_up13mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMPBIAS_vpbias_default                       0x00000008UL                                             /**< Mode vpbias_default for RAC_PATRIM2         */
#define _RAC_PATRIM2_PATRIMPBIAS_vpbias_dn13mv                        0x00000009UL                                             /**< Mode vpbias_dn13mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMPBIAS_vpbias_dn26mv                        0x0000000AUL                                             /**< Mode vpbias_dn26mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMPBIAS_vpbias_dn38mv                        0x0000000BUL                                             /**< Mode vpbias_dn38mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMPBIAS_vpbias_dn52mv                        0x0000000CUL                                             /**< Mode vpbias_dn52mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMPBIAS_vpbias_dn65mv                        0x0000000DUL                                             /**< Mode vpbias_dn65mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMPBIAS_vpbias_dn78mv                        0x0000000EUL                                             /**< Mode vpbias_dn78mv for RAC_PATRIM2          */
#define _RAC_PATRIM2_PATRIMPBIAS_vpbias_dn91mv                        0x0000000FUL                                             /**< Mode vpbias_dn91mv for RAC_PATRIM2          */
#define RAC_PATRIM2_PATRIMPBIAS_DEFAULT                               (_RAC_PATRIM2_PATRIMPBIAS_DEFAULT << 25)                 /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_PATRIMPBIAS_vpbias_up104mv                        (_RAC_PATRIM2_PATRIMPBIAS_vpbias_up104mv << 25)          /**< Shifted mode vpbias_up104mv for RAC_PATRIM2 */
#define RAC_PATRIM2_PATRIMPBIAS_vpbias_up91mv                         (_RAC_PATRIM2_PATRIMPBIAS_vpbias_up91mv << 25)           /**< Shifted mode vpbias_up91mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMPBIAS_vpbias_up78mv                         (_RAC_PATRIM2_PATRIMPBIAS_vpbias_up78mv << 25)           /**< Shifted mode vpbias_up78mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMPBIAS_vpbias_up65mv                         (_RAC_PATRIM2_PATRIMPBIAS_vpbias_up65mv << 25)           /**< Shifted mode vpbias_up65mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMPBIAS_vpbias_up52mv                         (_RAC_PATRIM2_PATRIMPBIAS_vpbias_up52mv << 25)           /**< Shifted mode vpbias_up52mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMPBIAS_vpbias_up39mv                         (_RAC_PATRIM2_PATRIMPBIAS_vpbias_up39mv << 25)           /**< Shifted mode vpbias_up39mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMPBIAS_vpbias_up26mv                         (_RAC_PATRIM2_PATRIMPBIAS_vpbias_up26mv << 25)           /**< Shifted mode vpbias_up26mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMPBIAS_vpbias_up13mv                         (_RAC_PATRIM2_PATRIMPBIAS_vpbias_up13mv << 25)           /**< Shifted mode vpbias_up13mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMPBIAS_vpbias_default                        (_RAC_PATRIM2_PATRIMPBIAS_vpbias_default << 25)          /**< Shifted mode vpbias_default for RAC_PATRIM2 */
#define RAC_PATRIM2_PATRIMPBIAS_vpbias_dn13mv                         (_RAC_PATRIM2_PATRIMPBIAS_vpbias_dn13mv << 25)           /**< Shifted mode vpbias_dn13mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMPBIAS_vpbias_dn26mv                         (_RAC_PATRIM2_PATRIMPBIAS_vpbias_dn26mv << 25)           /**< Shifted mode vpbias_dn26mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMPBIAS_vpbias_dn38mv                         (_RAC_PATRIM2_PATRIMPBIAS_vpbias_dn38mv << 25)           /**< Shifted mode vpbias_dn38mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMPBIAS_vpbias_dn52mv                         (_RAC_PATRIM2_PATRIMPBIAS_vpbias_dn52mv << 25)           /**< Shifted mode vpbias_dn52mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMPBIAS_vpbias_dn65mv                         (_RAC_PATRIM2_PATRIMPBIAS_vpbias_dn65mv << 25)           /**< Shifted mode vpbias_dn65mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMPBIAS_vpbias_dn78mv                         (_RAC_PATRIM2_PATRIMPBIAS_vpbias_dn78mv << 25)           /**< Shifted mode vpbias_dn78mv for RAC_PATRIM2  */
#define RAC_PATRIM2_PATRIMPBIAS_vpbias_dn91mv                         (_RAC_PATRIM2_PATRIMPBIAS_vpbias_dn91mv << 25)           /**< Shifted mode vpbias_dn91mv for RAC_PATRIM2  */
#define _RAC_PATRIM2_PATRIMPCASC_SHIFT                                29                                                       /**< Shift value for RAC_PATRIMPCASC             */
#define _RAC_PATRIM2_PATRIMPCASC_MASK                                 0x60000000UL                                             /**< Bit mask for RAC_PATRIMPCASC                */
#define _RAC_PATRIM2_PATRIMPCASC_DEFAULT                              0x00000001UL                                             /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_PATRIMPCASC_pcbias_p50mv                         0x00000000UL                                             /**< Mode pcbias_p50mv for RAC_PATRIM2           */
#define _RAC_PATRIM2_PATRIMPCASC_pcbias_default                       0x00000001UL                                             /**< Mode pcbias_default for RAC_PATRIM2         */
#define _RAC_PATRIM2_PATRIMPCASC_pcbias_m50mv                         0x00000002UL                                             /**< Mode pcbias_m50mv for RAC_PATRIM2           */
#define _RAC_PATRIM2_PATRIMPCASC_pcbias_m100mv                        0x00000003UL                                             /**< Mode pcbias_m100mv for RAC_PATRIM2          */
#define RAC_PATRIM2_PATRIMPCASC_DEFAULT                               (_RAC_PATRIM2_PATRIMPCASC_DEFAULT << 29)                 /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_PATRIMPCASC_pcbias_p50mv                          (_RAC_PATRIM2_PATRIMPCASC_pcbias_p50mv << 29)            /**< Shifted mode pcbias_p50mv for RAC_PATRIM2   */
#define RAC_PATRIM2_PATRIMPCASC_pcbias_default                        (_RAC_PATRIM2_PATRIMPCASC_pcbias_default << 29)          /**< Shifted mode pcbias_default for RAC_PATRIM2 */
#define RAC_PATRIM2_PATRIMPCASC_pcbias_m50mv                          (_RAC_PATRIM2_PATRIMPCASC_pcbias_m50mv << 29)            /**< Shifted mode pcbias_m50mv for RAC_PATRIM2   */
#define RAC_PATRIM2_PATRIMPCASC_pcbias_m100mv                         (_RAC_PATRIM2_PATRIMPCASC_pcbias_m100mv << 29)           /**< Shifted mode pcbias_m100mv for RAC_PATRIM2  */

