SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG21/Include/efr32bg21_rac.h
/* Bit fields for RAC XORETIMESTATUS */
#define _RAC_XORETIMESTATUS_RESETVALUE                                0x00000000UL                                              /**< Default value for RAC_XORETIMESTATUS        */
#define _RAC_XORETIMESTATUS_MASK                                      0x00000003UL                                              /**< Mask for RAC_XORETIMESTATUS                 */
#define RAC_XORETIMESTATUS_XORETIMECLKSEL                             (0x1UL << 0)                                              /**< XORETIMECLKSEL                              */
#define _RAC_XORETIMESTATUS_XORETIMECLKSEL_SHIFT                      0                                                         /**< Shift value for RAC_XORETIMECLKSEL          */
#define _RAC_XORETIMESTATUS_XORETIMECLKSEL_MASK                       0x1UL                                                     /**< Bit mask for RAC_XORETIMECLKSEL             */
#define _RAC_XORETIMESTATUS_XORETIMECLKSEL_DEFAULT                    0x00000000UL                                              /**< Mode DEFAULT for RAC_XORETIMESTATUS         */
#define _RAC_XORETIMESTATUS_XORETIMECLKSEL_use_raw_clk                0x00000000UL                                              /**< Mode use_raw_clk for RAC_XORETIMESTATUS     */
#define _RAC_XORETIMESTATUS_XORETIMECLKSEL_use_retimed_clk            0x00000001UL                                              /**< Mode use_retimed_clk for RAC_XORETIMESTATUS */
#define RAC_XORETIMESTATUS_XORETIMECLKSEL_DEFAULT                     (_RAC_XORETIMESTATUS_XORETIMECLKSEL_DEFAULT << 0)         /**< Shifted mode DEFAULT for RAC_XORETIMESTATUS */
#define RAC_XORETIMESTATUS_XORETIMECLKSEL_use_raw_clk                 (_RAC_XORETIMESTATUS_XORETIMECLKSEL_use_raw_clk << 0)     /**< Shifted mode use_raw_clk for RAC_XORETIMESTATUS*/
#define RAC_XORETIMESTATUS_XORETIMECLKSEL_use_retimed_clk             (_RAC_XORETIMESTATUS_XORETIMECLKSEL_use_retimed_clk << 0) /**< Shifted mode use_retimed_clk for RAC_XORETIMESTATUS*/
#define RAC_XORETIMESTATUS_XORETIMERESETNLO                           (0x1UL << 1)                                              /**< XORETIMERESETNLO                            */
#define _RAC_XORETIMESTATUS_XORETIMERESETNLO_SHIFT                    1                                                         /**< Shift value for RAC_XORETIMERESETNLO        */
#define _RAC_XORETIMESTATUS_XORETIMERESETNLO_MASK                     0x2UL                                                     /**< Bit mask for RAC_XORETIMERESETNLO           */
#define _RAC_XORETIMESTATUS_XORETIMERESETNLO_DEFAULT                  0x00000000UL                                              /**< Mode DEFAULT for RAC_XORETIMESTATUS         */
#define _RAC_XORETIMESTATUS_XORETIMERESETNLO_lo                       0x00000000UL                                              /**< Mode lo for RAC_XORETIMESTATUS              */
#define _RAC_XORETIMESTATUS_XORETIMERESETNLO_hi                       0x00000001UL                                              /**< Mode hi for RAC_XORETIMESTATUS              */
#define RAC_XORETIMESTATUS_XORETIMERESETNLO_DEFAULT                   (_RAC_XORETIMESTATUS_XORETIMERESETNLO_DEFAULT << 1)       /**< Shifted mode DEFAULT for RAC_XORETIMESTATUS */
#define RAC_XORETIMESTATUS_XORETIMERESETNLO_lo                        (_RAC_XORETIMESTATUS_XORETIMERESETNLO_lo << 1)            /**< Shifted mode lo for RAC_XORETIMESTATUS      */
#define RAC_XORETIMESTATUS_XORETIMERESETNLO_hi                        (_RAC_XORETIMESTATUS_XORETIMERESETNLO_hi << 1)            /**< Shifted mode hi for RAC_XORETIMESTATUS      */

/* Bit fields for RAC XOSQBUFFILT */
#define _RAC_XOSQBUFFILT_RESETVALUE                                   0x00000000UL                                 /**< Default value for RAC_XOSQBUFFILT           */
#define _RAC_XOSQBUFFILT_MASK                                         0x00000003UL                                 /**< Mask for RAC_XOSQBUFFILT                    */
#define _RAC_XOSQBUFFILT_XOSQBUFFILT_SHIFT                            0                                            /**< Shift value for RAC_XOSQBUFFILT             */
#define _RAC_XOSQBUFFILT_XOSQBUFFILT_MASK                             0x3UL                                        /**< Bit mask for RAC_XOSQBUFFILT                */
#define _RAC_XOSQBUFFILT_XOSQBUFFILT_DEFAULT                          0x00000000UL                                 /**< Mode DEFAULT for RAC_XOSQBUFFILT            */
#define _RAC_XOSQBUFFILT_XOSQBUFFILT_bypass                           0x00000000UL                                 /**< Mode bypass for RAC_XOSQBUFFILT             */
#define _RAC_XOSQBUFFILT_XOSQBUFFILT_filter_1                         0x00000001UL                                 /**< Mode filter_1 for RAC_XOSQBUFFILT           */
#define _RAC_XOSQBUFFILT_XOSQBUFFILT_filter_2                         0x00000002UL                                 /**< Mode filter_2 for RAC_XOSQBUFFILT           */
#define _RAC_XOSQBUFFILT_XOSQBUFFILT_filter_3                         0x00000003UL                                 /**< Mode filter_3 for RAC_XOSQBUFFILT           */
#define RAC_XOSQBUFFILT_XOSQBUFFILT_DEFAULT                           (_RAC_XOSQBUFFILT_XOSQBUFFILT_DEFAULT << 0)  /**< Shifted mode DEFAULT for RAC_XOSQBUFFILT    */
#define RAC_XOSQBUFFILT_XOSQBUFFILT_bypass                            (_RAC_XOSQBUFFILT_XOSQBUFFILT_bypass << 0)   /**< Shifted mode bypass for RAC_XOSQBUFFILT     */
#define RAC_XOSQBUFFILT_XOSQBUFFILT_filter_1                          (_RAC_XOSQBUFFILT_XOSQBUFFILT_filter_1 << 0) /**< Shifted mode filter_1 for RAC_XOSQBUFFILT   */
#define RAC_XOSQBUFFILT_XOSQBUFFILT_filter_2                          (_RAC_XOSQBUFFILT_XOSQBUFFILT_filter_2 << 0) /**< Shifted mode filter_2 for RAC_XOSQBUFFILT   */
#define RAC_XOSQBUFFILT_XOSQBUFFILT_filter_3                          (_RAC_XOSQBUFFILT_XOSQBUFFILT_filter_3 << 0) /**< Shifted mode filter_3 for RAC_XOSQBUFFILT   */

/* Bit fields for RAC ANTDIV */
#define _RAC_ANTDIV_RESETVALUE                                        0x00000000UL                           /**< Default value for RAC_ANTDIV                */
#define _RAC_ANTDIV_MASK                                              0x000003FFUL                           /**< Mask for RAC_ANTDIV                         */
#define _RAC_ANTDIV_EN_SHIFT                                          0                                      /**< Shift value for RAC_EN                      */
#define _RAC_ANTDIV_EN_MASK                                           0xFFUL                                 /**< Bit mask for RAC_EN                         */
#define _RAC_ANTDIV_EN_DEFAULT                                        0x00000000UL                           /**< Mode DEFAULT for RAC_ANTDIV                 */
#define _RAC_ANTDIV_EN_OFF                                            0x00000000UL                           /**< Mode OFF for RAC_ANTDIV                     */
#define _RAC_ANTDIV_EN_PAENANT1                                       0x00000001UL                           /**< Mode PAENANT1 for RAC_ANTDIV                */
#define _RAC_ANTDIV_EN_LNAMIXEN1                                      0x00000002UL                           /**< Mode LNAMIXEN1 for RAC_ANTDIV               */
#define _RAC_ANTDIV_EN_LNAMIXRFPKDENRF1                               0x00000004UL                           /**< Mode LNAMIXRFPKDENRF1 for RAC_ANTDIV        */
#define _RAC_ANTDIV_EN_SYLODIVRLO12G4EN                               0x00000008UL                           /**< Mode SYLODIVRLO12G4EN for RAC_ANTDIV        */
#define _RAC_ANTDIV_EN_PAENANT2                                       0x00000010UL                           /**< Mode PAENANT2 for RAC_ANTDIV                */
#define _RAC_ANTDIV_EN_LNAMIXEN2                                      0x00000020UL                           /**< Mode LNAMIXEN2 for RAC_ANTDIV               */
#define _RAC_ANTDIV_EN_LNAMIXRFPKDENRF2                               0x00000040UL                           /**< Mode LNAMIXRFPKDENRF2 for RAC_ANTDIV        */
#define _RAC_ANTDIV_EN_SYLODIVRLO22G4EN                               0x00000080UL                           /**< Mode SYLODIVRLO22G4EN for RAC_ANTDIV        */
#define _RAC_ANTDIV_EN_ON                                             0x000000FFUL                           /**< Mode ON for RAC_ANTDIV                      */
#define RAC_ANTDIV_EN_DEFAULT                                         (_RAC_ANTDIV_EN_DEFAULT << 0)          /**< Shifted mode DEFAULT for RAC_ANTDIV         */
#define RAC_ANTDIV_EN_OFF                                             (_RAC_ANTDIV_EN_OFF << 0)              /**< Shifted mode OFF for RAC_ANTDIV             */
#define RAC_ANTDIV_EN_PAENANT1                                        (_RAC_ANTDIV_EN_PAENANT1 << 0)         /**< Shifted mode PAENANT1 for RAC_ANTDIV        */
#define RAC_ANTDIV_EN_LNAMIXEN1                                       (_RAC_ANTDIV_EN_LNAMIXEN1 << 0)        /**< Shifted mode LNAMIXEN1 for RAC_ANTDIV       */
#define RAC_ANTDIV_EN_LNAMIXRFPKDENRF1                                (_RAC_ANTDIV_EN_LNAMIXRFPKDENRF1 << 0) /**< Shifted mode LNAMIXRFPKDENRF1 for RAC_ANTDIV*/
#define RAC_ANTDIV_EN_SYLODIVRLO12G4EN                                (_RAC_ANTDIV_EN_SYLODIVRLO12G4EN << 0) /**< Shifted mode SYLODIVRLO12G4EN for RAC_ANTDIV*/
#define RAC_ANTDIV_EN_PAENANT2                                        (_RAC_ANTDIV_EN_PAENANT2 << 0)         /**< Shifted mode PAENANT2 for RAC_ANTDIV        */
#define RAC_ANTDIV_EN_LNAMIXEN2                                       (_RAC_ANTDIV_EN_LNAMIXEN2 << 0)        /**< Shifted mode LNAMIXEN2 for RAC_ANTDIV       */
#define RAC_ANTDIV_EN_LNAMIXRFPKDENRF2                                (_RAC_ANTDIV_EN_LNAMIXRFPKDENRF2 << 0) /**< Shifted mode LNAMIXRFPKDENRF2 for RAC_ANTDIV*/
#define RAC_ANTDIV_EN_SYLODIVRLO22G4EN                                (_RAC_ANTDIV_EN_SYLODIVRLO22G4EN << 0) /**< Shifted mode SYLODIVRLO22G4EN for RAC_ANTDIV*/
#define RAC_ANTDIV_EN_ON                                              (_RAC_ANTDIV_EN_ON << 0)               /**< Shifted mode ON for RAC_ANTDIV              */
#define _RAC_ANTDIV_STATUS_SHIFT                                      8                                      /**< Shift value for RAC_STATUS                  */
#define _RAC_ANTDIV_STATUS_MASK                                       0x300UL                                /**< Bit mask for RAC_STATUS                     */
#define _RAC_ANTDIV_STATUS_DEFAULT                                    0x00000000UL                           /**< Mode DEFAULT for RAC_ANTDIV                 */
#define _RAC_ANTDIV_STATUS_OFF                                        0x00000000UL                           /**< Mode OFF for RAC_ANTDIV                     */
#define _RAC_ANTDIV_STATUS_ANT1                                       0x00000001UL                           /**< Mode ANT1 for RAC_ANTDIV                    */
#define _RAC_ANTDIV_STATUS_ANT2                                       0x00000002UL                           /**< Mode ANT2 for RAC_ANTDIV                    */
#define _RAC_ANTDIV_STATUS_BOTH                                       0x00000003UL                           /**< Mode BOTH for RAC_ANTDIV                    */
#define RAC_ANTDIV_STATUS_DEFAULT                                     (_RAC_ANTDIV_STATUS_DEFAULT << 8)      /**< Shifted mode DEFAULT for RAC_ANTDIV         */
#define RAC_ANTDIV_STATUS_OFF                                         (_RAC_ANTDIV_STATUS_OFF << 8)          /**< Shifted mode OFF for RAC_ANTDIV             */
#define RAC_ANTDIV_STATUS_ANT1                                        (_RAC_ANTDIV_STATUS_ANT1 << 8)         /**< Shifted mode ANT1 for RAC_ANTDIV            */
#define RAC_ANTDIV_STATUS_ANT2                                        (_RAC_ANTDIV_STATUS_ANT2 << 8)         /**< Shifted mode ANT2 for RAC_ANTDIV            */
#define RAC_ANTDIV_STATUS_BOTH                                        (_RAC_ANTDIV_STATUS_BOTH << 8)         /**< Shifted mode BOTH for RAC_ANTDIV            */

/* Bit fields for RAC SCRATCH0 */
#define _RAC_SCRATCH0_RESETVALUE                                      0x00000000UL                          /**< Default value for RAC_SCRATCH0              */
#define _RAC_SCRATCH0_MASK                                            0xFFFFFFFFUL                          /**< Mask for RAC_SCRATCH0                       */
#define _RAC_SCRATCH0_SCRATCH0_SHIFT                                  0                                     /**< Shift value for RAC_SCRATCH0                */
#define _RAC_SCRATCH0_SCRATCH0_MASK                                   0xFFFFFFFFUL                          /**< Bit mask for RAC_SCRATCH0                   */
#define _RAC_SCRATCH0_SCRATCH0_DEFAULT                                0x00000000UL                          /**< Mode DEFAULT for RAC_SCRATCH0               */
#define RAC_SCRATCH0_SCRATCH0_DEFAULT                                 (_RAC_SCRATCH0_SCRATCH0_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_SCRATCH0       */

/* Bit fields for RAC SCRATCH1 */
#define _RAC_SCRATCH1_RESETVALUE                                      0x00000000UL                          /**< Default value for RAC_SCRATCH1              */
#define _RAC_SCRATCH1_MASK                                            0xFFFFFFFFUL                          /**< Mask for RAC_SCRATCH1                       */
#define _RAC_SCRATCH1_SCRATCH1_SHIFT                                  0                                     /**< Shift value for RAC_SCRATCH1                */
#define _RAC_SCRATCH1_SCRATCH1_MASK                                   0xFFFFFFFFUL                          /**< Bit mask for RAC_SCRATCH1                   */
#define _RAC_SCRATCH1_SCRATCH1_DEFAULT                                0x00000000UL                          /**< Mode DEFAULT for RAC_SCRATCH1               */
#define RAC_SCRATCH1_SCRATCH1_DEFAULT                                 (_RAC_SCRATCH1_SCRATCH1_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_SCRATCH1       */

